Revit 2027 API
PartUtils.GetMergedParts Method
 Retrieves the element ids of the source elements of a merged part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetMergedParts(
	Part part
)
Public Shared Function GetMergedParts (
	part As Part
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetMergedParts(
	Part^ part
)
static member GetMergedParts :
        part : Part -> ICollection<ElementId>
Parameters
part Part
 A merged part.
Return Value
ICollection<ElementId>
 The element ids of the parts that were merged to create the specified merged part.
Exceptions
Exception | Condition
ArgumentException |  The specified Part is not a merged part.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
Autodesk.Revit.DB Namespace